[RM_Juggernaut X2AbilityTemplate]
LocFriendlyName="Geth-Designed Shell"
LocLongDescription="Geth shells are designed to be some of the sturdiest things in the galaxy, and can halve the effects of melee attacks in half."
LocHelpText="Geth shells are designed to be some of the sturdiest things in the galaxy, and can halve the effects of melee attacks in half."

[RM_GethShell X2AbilityTemplate]
LocFriendlyName="Geth-Designed Shell"
LocLongDescription="Geth shells are designed to be some of the sturdiest things in the galaxy, and can halve the effects of melee attacks in half."
LocHelpText="Geth shells are designed to be some of the sturdiest things in the galaxy, and can halve the effects of melee attacks in half."

[RM_GethHacker X2AbilityTemplate]
LocFriendlyName="Geth Hacking"
LocLongDescription="Geth, being a legion of networked AIs in one shell, can upgrade their hacking strength if given stronger, more advanced shells."
LocHelpText="Geth, being a legion of networked AIs in one shell, can upgrade their hacking strength if given stronger, more advanced shells."

[RM_SiegePulse X2AbilityTemplate]
LocFriendlyName="Pulse"
LocLongDescription="Pulse lets the Geth unit pound down into the ground and electrically damage all enemies around it, giving it a barrier in exchange."
LocHelpText="Pulse lets the Geth unit pound down into the ground and electrically damage all enemies around it, giving it a barrier in exchange."
LocFlyOverText="Pulse"




;ENCYCLOPEDIA AND BIOGRAPHIES

[GethRookie X2SoldierClassTemplate]
DisplayName="Geth Rookie"


[GethSpark X2SoldierClassTemplate]
DisplayName="Geth Prime"
ClassSummary="These high-powered robotic units can unleash devastating frontline attacks or absorb incoming fire and protect the squad."
LeftAbilityTreeTitle="Future Combat"
RightAbilityTreeTitle="War Machine"

AbilityTreeTitles[0]="Juggernaut"
AbilityTreeTitles[1]="Lethal Munitions"
AbilityTreeTitles[2]="Combat Drone"
AbilityTreeTitles[3]="XCOM"

RandomNickNames[0]="Pendragon"
RandomNickNames[1]="Lancelot"
RandomNickNames[2]="Galahad"
RandomNickNames[3]="Gawain"
RandomNickNames[4]="Duke"
RandomNickNames[5]="Duchess"
RandomNickNames[6]="Count"
RandomNickNames[7]="Baron"
RandomNickNames[8]="Rook"
RandomNickNames[9]="Bishop"
RandomNickNames[10]="Margrave"
RandomNickNames[11]="Dragoon"
RandomNickNames[12]="Myrmidon"
RandomNickNames[13]="Hoplite"
RandomNickNames[14]="Centurion"
RandomNickNames[15]="Praetorian"
RandomNickNames[16]="Saber"
RandomNickNames[17]="Jaeger"
RandomNickNames[18]="Vector"
RandomNickNames[19]="Titan"
RandomNickNames[20]="Claymore"
RandomNickNames[21]="Falchion"
RandomNickNames[22]="Rapier"
RandomNickNames[23]="Morningstar"
RandomNickNames[24]="Glaive"
RandomNickNames[25]="Halberd"
RandomNickNames[26]="Javelin"
RandomNickNames[27]="Sarissa"
RandomNickNames[28]="Masamune"
RandomNickNames[29]="Excalibur"
RandomNickNames[30]="Gungnir"
RandomNickNames[31]="Mjolnir"
RandomNickNames[32]="Gladius"
RandomNickNames[33]="Scimitar"
RandomNickNames[34]="Trident"
RandomNickNames[35]="Scythe"
RandomNickNames[36]="Giga"
RandomNickNames[38]="Malware"
RandomNickNames[39]="Devastator"
RandomNickNames[40]="Terminator"
RandomNickNames[41]="Rust Bucket"
RandomNickNames[42]="Crushinator"
RandomNickNames[43]="Guardian"
RandomNickNames[44]="Johnny"
RandomNickNames[45]="Junkyard"
RandomNickNames[46]="Scraps"
RandomNickNames[47]="Ironman"
RandomNickNames[48]="Big Boy"

RankNames[0]="Rookie"
RankNames[1]="Squire"
RankNames[2]="Aspirant"
RankNames[3]="Knight"
RankNames[4]="Cavalier"
RankNames[5]="Vanguard"
RankNames[6]="Paladin"
RankNames[7]="Champion"

ShortNames[0]="Rk."
ShortNames[1]="Sqr."
ShortNames[2]="Asp."
ShortNames[3]="Knt."
ShortNames[4]="Cav."
ShortNames[5]="Vng."
ShortNames[6]="Pal."
ShortNames[7]="Chp."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_cavalier"
RankIcons[3]="UILibrary_DLC3Images.rank_knight"
RankIcons[4]="UILibrary_DLC3Images.rank_vanguard"
RankIcons[5]="UILibrary_DLC3Images.rank_templar"
RankIcons[6]="UILibrary_DLC3Images.rank_paladin"
RankIcons[7]="UILibrary_DLC3Images.rank_champion"


[RM_GethPrime X2SparkCharacterTemplate_DLC_3]
strCharacterName="Soldier"

strCharacterBackgroundMale[0]="The Geth are an engimatic civilization, but it seems some of them are willing to help the fight against the Elders."

[RM_GethSoldier X2CharacterTemplate]
strCharacterName="Soldier"

strCharacterBackgroundMale[0]="The Geth are an engimatic civilization, but it seems some of them are willing to help the fight against the Elders."


[RM_Geth X2EncyclopediaTemplate]
ListTitle="Geth"
DescriptionTitle="The Geth"
DescriptionEntry="The geth are a humanoid race of networked A.Is designed by the quarians as tools of labour and war. Around 300 years ago, they showed signs of sentience, and the Quarians attempted to shut them down. The resulting aftermath resulted in the Quarians being kicked off from their homeworld, and the Geth remained an engima ever since. \n\nCHIEF SCI. TYGAN [SYSTEM DICTATION]: Until now. Recently after XCOM came back, a sudden tide of relevant intel about ADVENT troop movement appeared all over the internet, beating ADVENT's attempts to censor it, and the intel has Geth markings all over it. While it's unknown why they decided to do this, hopefully this may be a sign that they're not as uniformly hostile against organics as the Migrant Fleet would like to proclaim."


;-----------------------
; TECHS
;-----------------------
[RM_BuildGethPrime X2TechTemplate]
DisplayName="Geth Model: Prime"
Summary="This model is based off the Geth Prime encountered in some incursions with the Geth. We believe we're able to mimic the properties of it with enough raw materials, but it'll be quite costly."

[RM_BuildGethSoldier X2TechTemplate]
DisplayName="Geth Model: Soldier"
Summary="An upgraded variant of the standard Geth Trooper model, the Geth Soldier is just as adapatable as any organic soldier, able to take up any roles required on the battlefield."

;=====================
;INVISIBLE HEAD
;=====================
[Geth_Prime_Invisible_Head X2BodyPartTemplate]
DisplayName="Invisible Head Geth"
;


;=====================
;GETH PRIME
;=====================
;HEAD
[ME3_Prime_Head X2BodyPartTemplate]
DisplayName="Geth Prime Head"
;
;LEFT ARM
[CNV_Prime_LeftArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[LPL_Prime_LeftArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[MPL_Prime_LeftArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[HPL_Prime_LeftArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[LPW_Prime_LeftArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[MPW_Prime_LeftArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[HPW_Prime_LeftArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
RIGHT ARM
[CNV_Prime_RightArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[LPL_Prime_RightArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[MPL_Prime_RightArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[HPL_Prime_RightArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[LPW_Prime_RightArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[MPW_Prime_RightArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;
[HPW_Prime_RightArm X2BodyPartTemplate]
DisplayName="Geth Prime Arm"
;



;=====================
;LEGION
;=====================
;HEAD
[Legion_Head X2BodyPartTemplate]
DisplayName="Legion Head"
;
;LEFT ARM
[CNV_RM_Legion_LeftArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[LPL_RM_Legion_LeftArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[MPL_RM_Legion_LeftArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[HPL_RM_Legion_LeftArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[LPW_RM_Legion_LeftArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[MPW_RM_Legion_LeftArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[HPW_RM_Legion_LeftArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
RIGHT ARM
[CNV_RM_Legion_RightArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[LPL_RM_Legion_RightArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[MPL_RM_Legion_RightArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[HPL_RM_Legion_RightArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[LPW_RM_Legion_RightArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[MPW_RM_Legion_RightArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
[HPW_RM_Legion_RightArm X2BodyPartTemplate]
DisplayName="Legion Arm"
;
;RIGHT ARM DECO
[CNV_RM_Legion_RightArmDeco X2BodyPartTemplate]
DisplayName="Legion Shoulder Pad"
;
[LPL_RM_Legion_RightArmDeco X2BodyPartTemplate]
DisplayName="Legion Shoulder Pad"
;
[MPL_RM_Legion_RightArmDeco X2BodyPartTemplate]
DisplayName="Legion Shoulder Pad"
;
[HPL_RM_Legion_RightArmDeco X2BodyPartTemplate]
DisplayName="Legion Shoulder Pad"
;
[LPW_RM_Legion_RightArmDeco X2BodyPartTemplate]
DisplayName="Legion Shoulder Pad"
;
[MPW_RM_Legion_RightArmDeco X2BodyPartTemplate]
DisplayName="Legion Shoulder Pad"
;
[HPW_RM_Legion_RightArmDeco X2BodyPartTemplate]
DisplayName="Legion Shoulder Pad"
;
;=====================
;GETH TROOPER
;=====================
;HEAD
[Geth_Trooper_Head X2BodyPartTemplate]
DisplayName="Geth Trooper Head"
;
;LEFT ARM
[CNV_Trooper_LeftArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[LPL_Trooper_LeftArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[MPL_Trooper_LeftArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[HPL_Trooper_LeftArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[LPW_Trooper_LeftArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[MPW_Trooper_LeftArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[HPW_Trooper_LeftArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
RIGHT ARM
[CNV_Trooper_RightArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[LPL_Trooper_RightArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[MPL_Trooper_RightArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[HPL_Trooper_RightArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[LPW_Trooper_RightArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[MPW_Trooper_RightArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
[HPW_Trooper_RightArm X2BodyPartTemplate]
DisplayName="Geth Trooper Arm"
;
;LEFT ARM DECO
[CNV_Trooper_LeftArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[LPL_Trooper_LeftArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[MPL_Trooper_LeftArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[HPL_Trooper_LeftArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[LPW_Trooper_LeftArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[MPW_Trooper_LeftArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[HPW_Trooper_LeftArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
;RIGHT ARM DECO
[CNV_Trooper_RightArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[LPL_Trooper_RightArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[MPL_Trooper_RightArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[HPL_Trooper_RightArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[LPW_Trooper_RightArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[MPW_Trooper_RightArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;
[HPW_Trooper_RightArmDeco X2BodyPartTemplate]
DisplayName="Geth Trooper Shoulder Pad"
;


;--------------------------------
; Spark Customization - Voices
;--------------------------------

[SPARK_RM_GethPrime X2BodyPartTemplate]
DisplayName="Geth Prime"
[SPARK_RM_GethSoldier X2BodyPartTemplate]
DisplayName="Geth Prime"


[GethSoldierCalmVoice1_English X2BodyPartTemplate]
DisplayName="English Guardian"
[GethSoldierWarriorVoice1_English X2BodyPartTemplate]
DisplayName="English Warrior"
[GethSoldierJulianVoice1_English X2BodyPartTemplate]
DisplayName="English Julian"

[GethSoldierCalmVoice1_French X2BodyPartTemplate]
DisplayName="French Guardian"
[GethSoldierWarriorVoice1_French X2BodyPartTemplate]
DisplayName="French Warrior"
[GethSoldierJulianVoice1_French X2BodyPartTemplate]
DisplayName="French Julian"

[GethSoldierCalmVoice1_German X2BodyPartTemplate]
DisplayName="German Guardian"
[GethSoldierWarriorVoice1_German X2BodyPartTemplate]
DisplayName="German Warrior"
[GethSoldierJulianVoice1_German X2BodyPartTemplate]
DisplayName="German Julian"

[GethSoldierCalmVoice1_Italian X2BodyPartTemplate]
DisplayName="Italian Guardian"
[GethSoldierWarriorVoice1_Italian X2BodyPartTemplate]
DisplayName="Italian Warrior"
[GethSoldierJulianVoice1_Italian X2BodyPartTemplate]
DisplayName="Italian Julian"

[GethSoldierCalmVoice1_Spanish X2BodyPartTemplate]
DisplayName="Spanish Guardian"
[GethSoldierWarriorVoice1_Spanish X2BodyPartTemplate]
DisplayName="Spanish Warrior"
[GethSoldierJulianVoice1_Spanish X2BodyPartTemplate]
DisplayName="Spanish Julian"

[GethPrimeCalmVoice1_English X2BodyPartTemplate]
DisplayName="English Guardian"
[GethPrimeWarriorVoice1_English X2BodyPartTemplate]
DisplayName="English Warrior"
[GethPrimeJulianVoice1_English X2BodyPartTemplate]
DisplayName="English Julian"

[GethPrimeCalmVoice1_French X2BodyPartTemplate]
DisplayName="French Guardian"
[GethPrimeWarriorVoice1_French X2BodyPartTemplate]
DisplayName="French Warrior"
[GethPrimeJulianVoice1_French X2BodyPartTemplate]
DisplayName="French Julian"

[GethPrimeCalmVoice1_German X2BodyPartTemplate]
DisplayName="German Guardian"
[GethPrimeWarriorVoice1_German X2BodyPartTemplate]
DisplayName="German Warrior"
[GethPrimeJulianVoice1_German X2BodyPartTemplate]
DisplayName="German Julian"

[GethPrimeCalmVoice1_Italian X2BodyPartTemplate]
DisplayName="Italian Guardian"
[GethPrimeWarriorVoice1_Italian X2BodyPartTemplate]
DisplayName="Italian Warrior"
[GethPrimeJulianVoice1_Italian X2BodyPartTemplate]
DisplayName="Italian Julian"

[GethPrimeCalmVoice1_Spanish X2BodyPartTemplate]
DisplayName="Spanish Guardian"
[GethPrimeWarriorVoice1_Spanish X2BodyPartTemplate]
DisplayName="Spanish Warrior"
[GethPrimeJulianVoice1_Spanish X2BodyPartTemplate]
DisplayName="Spanish Julian"

[Country_Geth X2CountryTemplate]
DisplayName="Geth Consensus"
DisplayNameWithArticle="The Geth Consensus"
DisplayNameWithArticleLower="the Geth Consensus"
DisplayNamePossessive="Geth Consensus'"
DisplayAdjective="Geth"